[![imagenes/pythonista.png](imagenes/pythonista.png)](https://pythonista.io)

In [3]:
import pandas as pd
import numpy as np

## Broadcasting.

**Ejemplo:**

In [8]:
datos = pd.DataFrame(np.arange(20).reshape(5,4), 
                     columns=('primero', 'segundo', 'tercero', 'cuarto'))

In [9]:
datos

   primero  segundo  tercero  cuarto
0        0        1        2       3
1        4        5        6       7
2        8        9       10      11
3       12       13       14      15
4       16       17       18      19

In [10]:
datos[2:]*5

   primero  segundo  tercero  cuarto
2       40       45       50      55
3       60       65       70      75
4       80       85       90      95

In [12]:
datos ** 2

   primero  segundo  tercero  cuarto
0        0        1        4       9
1       16       25       36      49
2       64       81      100     121
3      144      169      196     225
4      256      289      324     361

## Algunos métodos.

### El método *info()*.

In [21]:
cursos = pd.DataFrame({'nombres':('Juan Pérez', 'María Sánchez', 'Jorge Vargas', 'Rodrigo Martínez'),
            'fechas':(pd.datetime(95,12,21), pd.datetime(89,1,13), pd.datetime(92,9,14), pd.datetime(93,7,8)),
            'saldo': (2500, 5345, np.NaN, 11323.2),
            'al corriente':(True, True, False, True)})

In [23]:
cursos

            nombres               fechas    saldo  al corriente
0        Juan Pérez  0095-12-21 00:00:00   2500.0          True
1     María Sánchez  0089-01-13 00:00:00   5345.0          True
2      Jorge Vargas  0092-09-14 00:00:00      NaN         False
3  Rodrigo Martínez  0093-07-08 00:00:00  11323.2          True

In [22]:
cursos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
nombres         4 non-null object
fechas          4 non-null object
saldo           3 non-null float64
al corriente    4 non-null bool
dtypes: bool(1), float64(1), object(2)
memory usage: 180.0+ bytes

### El método *reindex()*.

In [27]:
cursos.reindex((1, 3, 3, 2))

            nombres               fechas    saldo  al corriente
1     María Sánchez  0089-01-13 00:00:00   5345.0          True
3  Rodrigo Martínez  0093-07-08 00:00:00  11323.2          True
3  Rodrigo Martínez  0093-07-08 00:00:00  11323.2          True
2      Jorge Vargas  0092-09-14 00:00:00      NaN         False

## El método *iloc()*

In [36]:
datos.iloc[2,[3]]

al corriente    False
Name: 2, dtype: object

## El metodo loc()

<p style="text-align: center"><a rel="license" href="http://creativecommons.org/licenses/by/4.0/"><img alt="Licencia Creative Commons" style="border-width:0" src="https://i.creativecommons.org/l/by/4.0/80x15.png" /></a><br />Esta obra está bajo una <a rel="license" href="http://creativecommons.org/licenses/by/4.0/">Licencia Creative Commons Atribución 4.0 Internacional</a>.</p>
<p style="text-align: center">&copy; José Luis Chiquete Valdivieso. 2018.</p>